veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_BRIDGE_PTR1_Bits.ABT_TRAN_PGR */
#define IFX_GTM_BRIDGE_PTR1_ABT_TRAN_PGR_OFF (15u)

/** \brief Length for Ifx_GTM_BRIDGE_PTR1_Bits.FBC */
#define IFX_GTM_BRIDGE_PTR1_FBC_LEN (6u)

/** \brief Mask for Ifx_GTM_BRIDGE_PTR1_Bits.FBC */
#define IFX_GTM_BRIDGE_PTR1_FBC_MSK (0x3fu)

/** \brief Offset for Ifx_GTM_BRIDGE_PTR1_Bits.FBC */
#define IFX_GTM_BRIDGE_PTR1_FBC_OFF (20u)

/** \brief Length for Ifx_GTM_BRIDGE_PTR1_Bits.RSP_TRAN_RDY */
#define IFX_GTM_BRIDGE_PTR1_RSP_TRAN_RDY_LEN (6u)

/** \brief Mask for Ifx_GTM_BRIDGE_PTR1_Bits.RSP_TRAN_RDY */
#define IFX_GTM_BRIDGE_PTR1_RSP_TRAN_RDY_MSK (0x3fu)

/** \brief Offset for Ifx_GTM_BRIDGE_PTR1_Bits.RSP_TRAN_RDY */
#define IFX_GTM_BRIDGE_PTR1_RSP_TRAN_RDY_OFF (26u)

/** \brief Length for Ifx_GTM_BRIDGE_PTR2_Bits.TRAN_IN_PGR2 */
#define IFX_GTM_BRIDGE_PTR2_TRAN_IN_PGR2_LEN (5u)

/** \brief Mask for Ifx_GTM_BRIDGE_PTR2_Bits.TRAN_IN_PGR2 */
#define IFX_GTM_BRIDGE_PTR2_TRAN_IN_PGR2_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_BRIDGE_PTR2_Bits.TRAN_IN_PGR2 */
#define IFX_GTM_BRIDGE_PTR2_TRAN_IN_PGR2_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS0 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS0_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS0 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS0 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS0_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS1 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS1_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS1 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS1 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS1_OFF (2u)

/** \brief Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS2 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS2_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS2 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS2 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS2_OFF (4u)

/** \brief Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS3 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS3_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS3 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS3 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS3_OFF (6u)

/** \brief Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS4 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS4_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS4 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS4_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS4 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS4_OFF (8u)

/** \brief Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS5 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS5_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS5 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS5_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS5 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS5_OFF (10u)

/** \brief Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS6 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS6_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS6 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS6_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS6 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS6_OFF (12u)

/** \brief Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS7 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS7_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS7 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS7_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS7 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS7_OFF (14u)

/** \brief Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS8 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS8_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS8 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS8_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS8 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS8_OFF (16u)

/** \brief Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS9 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS9_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS9 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS9_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS9 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS9_OFF (18u)

/** \brief Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS10 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS10_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS10 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS10_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS10 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS10_OFF (20u)

/** \brief Length for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS11 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS11_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS11 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS11_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_AEM_DIS_Bits.DIS_CLS11 */
#define IFX_GTM_MCS_AEM_DIS_DIS_CLS11_OFF (22u)

/** \brief Length for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH0 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH0_LEN (1u)

/** \brief Mask for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH0 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH0 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH0_OFF (0u)

/** \brief Length for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH1 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH1_LEN (1u)

/** \brief Mask for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH1 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH1 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH1_OFF (1u)

/** \brief Length for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH2 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH2_LEN (1u)

/** \brief Mask for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH2 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH2 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH2_OFF (2u)

/** \brief Length for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH3 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH3_LEN (1u)

/** \brief Mask for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH3 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_AUX_IN_SRC_TIM_Bits.SRC_CH3 */
#define IFX_GTM_AUX_IN_SRC_TIM_SRC_CH3_OFF (3u)

