veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM3_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM3_CH13_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM3_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM3_CH13_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM3_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM3_CH13_IRQ_OFF (29u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM3_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM3_CH14_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM3_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM3_CH14_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM3_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM3_CH14_IRQ_OFF (30u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R7_Bits.TOM3_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM3_CH15_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R7_Bits.TOM3_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM3_CH15_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R7_Bits.TOM3_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_R7_TOM3_CH15_IRQ_OFF (31u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH2_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH3_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH4_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH5_IRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH6_IRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH7_IRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH0_IRQ_OFF (8u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH1_IRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH2_IRQ_OFF (10u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH3_IRQ_OFF (11u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH4_IRQ_OFF (12u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH5_IRQ_OFF (13u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM1_CH6_IRQ_MSK (0x1u)

