veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH2_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH3_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH4_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH5_IRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH6_IRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M0_CH7_IRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH0_IRQ_OFF (8u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH1_IRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH2_IRQ_OFF (10u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH3_IRQ_OFF (11u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH4_IRQ_OFF (12u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH5_IRQ_OFF (13u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH6_IRQ_OFF (14u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M1_CH7_IRQ_OFF (15u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH0_IRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH1_IRQ_OFF (17u)

