veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH2_IRQ_OFF (18u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH3_IRQ_OFF (19u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH4_IRQ_OFF (20u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH5_IRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH6_IRQ_OFF (22u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M2_CH7_IRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH0_IRQ_OFF (24u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH1_IRQ_OFF (25u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH2_IRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH3_IRQ_OFF (27u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH4_IRQ_OFF (28u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH5_IRQ_OFF (29u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH6_IRQ_OFF (30u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_ATOM_Bits.ATOM_M3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_ATOM_ATOM_M3_CH7_IRQ_OFF (31u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M0_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M0_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M0_CH0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M0_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M0_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M0_CH1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M0_CH2_IRQ_LEN (1u)

