veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_DPLL_CTRL_0_Bits.MLT */
#define IFX_GTM_DPLL_CTRL_0_MLT_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_0_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_IFP_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_0_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_IFP_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_0_Bits.IFP */
#define IFX_GTM_DPLL_CTRL_0_IFP_OFF (10u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_0_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_0_SNU_LEN (5u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_0_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_0_SNU_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_0_Bits.SNU */
#define IFX_GTM_DPLL_CTRL_0_SNU_OFF (11u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_0_Bits.TNU */
#define IFX_GTM_DPLL_CTRL_0_TNU_LEN (9u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_0_Bits.TNU */
#define IFX_GTM_DPLL_CTRL_0_TNU_MSK (0x1ffu)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_0_Bits.TNU */
#define IFX_GTM_DPLL_CTRL_0_TNU_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_0_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_AMS_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_0_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_AMS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_0_Bits.AMS */
#define IFX_GTM_DPLL_CTRL_0_AMS_OFF (25u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_0_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_AMT_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_0_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_AMT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_0_Bits.AMT */
#define IFX_GTM_DPLL_CTRL_0_AMT_OFF (26u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_0_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_IDS_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_0_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_IDS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_0_Bits.IDS */
#define IFX_GTM_DPLL_CTRL_0_IDS_OFF (27u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_0_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_IDT_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_0_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_IDT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_0_Bits.IDT */
#define IFX_GTM_DPLL_CTRL_0_IDT_OFF (28u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_0_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SEN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_0_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SEN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_0_Bits.SEN */
#define IFX_GTM_DPLL_CTRL_0_SEN_OFF (29u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_0_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_TEN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_0_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_TEN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_0_Bits.TEN */
#define IFX_GTM_DPLL_CTRL_0_TEN_OFF (30u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_0_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_RMO_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_0_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_RMO_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_0_Bits.RMO */
#define IFX_GTM_DPLL_CTRL_0_RMO_OFF (31u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_DMO_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_DMO_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.DMO */
#define IFX_GTM_DPLL_CTRL_1_DMO_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.DEN */
#define IFX_GTM_DPLL_CTRL_1_DEN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.DEN */
#define IFX_GTM_DPLL_CTRL_1_DEN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.DEN */
#define IFX_GTM_DPLL_CTRL_1_DEN_OFF (1u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.IDDS */
#define IFX_GTM_DPLL_CTRL_1_IDDS_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.IDDS */
#define IFX_GTM_DPLL_CTRL_1_IDDS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.IDDS */
#define IFX_GTM_DPLL_CTRL_1_IDDS_OFF (2u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_COA_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_COA_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.COA */
#define IFX_GTM_DPLL_CTRL_1_COA_OFF (3u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.PIT */
#define IFX_GTM_DPLL_CTRL_1_PIT_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.PIT */
#define IFX_GTM_DPLL_CTRL_1_PIT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.PIT */
#define IFX_GTM_DPLL_CTRL_1_PIT_OFF (4u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SGE1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SGE1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SGE1 */
#define IFX_GTM_DPLL_CTRL_1_SGE1_OFF (5u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_DLM1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_DLM1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.DLM1 */
#define IFX_GTM_DPLL_CTRL_1_DLM1_OFF (6u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_PCM1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_PCM1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.PCM1 */
#define IFX_GTM_DPLL_CTRL_1_PCM1_OFF (7u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SGE2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SGE2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.SGE2 */
#define IFX_GTM_DPLL_CTRL_1_SGE2_OFF (8u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.DLM2 */
#define IFX_GTM_DPLL_CTRL_1_DLM2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_1_Bits.DLM2 */
#define IFX_GTM_DPLL_CTRL_1_DLM2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_1_Bits.DLM2 */
#define IFX_GTM_DPLL_CTRL_1_DLM2_OFF (9u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_1_Bits.PCM2 */
#define IFX_GTM_DPLL_CTRL_1_PCM2_LEN (1u)

