veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_DPLL_CTRL_5_Bits.AEN30 */
#define IFX_GTM_DPLL_CTRL_5_AEN30_OFF (14u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_5_Bits.AEN31 */
#define IFX_GTM_DPLL_CTRL_5_AEN31_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_5_Bits.AEN31 */
#define IFX_GTM_DPLL_CTRL_5_AEN31_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_5_Bits.AEN31 */
#define IFX_GTM_DPLL_CTRL_5_AEN31_OFF (15u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_5_Bits.WAD24 */
#define IFX_GTM_DPLL_CTRL_5_WAD24_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_5_Bits.WAD24 */
#define IFX_GTM_DPLL_CTRL_5_WAD24_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_5_Bits.WAD24 */
#define IFX_GTM_DPLL_CTRL_5_WAD24_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_5_Bits.WAD25 */
#define IFX_GTM_DPLL_CTRL_5_WAD25_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_5_Bits.WAD25 */
#define IFX_GTM_DPLL_CTRL_5_WAD25_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_5_Bits.WAD25 */
#define IFX_GTM_DPLL_CTRL_5_WAD25_OFF (17u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_5_Bits.WAD26 */
#define IFX_GTM_DPLL_CTRL_5_WAD26_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_5_Bits.WAD26 */
#define IFX_GTM_DPLL_CTRL_5_WAD26_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_5_Bits.WAD26 */
#define IFX_GTM_DPLL_CTRL_5_WAD26_OFF (18u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_5_Bits.WAD27 */
#define IFX_GTM_DPLL_CTRL_5_WAD27_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_5_Bits.WAD27 */
#define IFX_GTM_DPLL_CTRL_5_WAD27_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_5_Bits.WAD27 */
#define IFX_GTM_DPLL_CTRL_5_WAD27_OFF (19u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_5_Bits.WAD28 */
#define IFX_GTM_DPLL_CTRL_5_WAD28_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_5_Bits.WAD28 */
#define IFX_GTM_DPLL_CTRL_5_WAD28_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_5_Bits.WAD28 */
#define IFX_GTM_DPLL_CTRL_5_WAD28_OFF (20u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_5_Bits.WAD29 */
#define IFX_GTM_DPLL_CTRL_5_WAD29_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_5_Bits.WAD29 */
#define IFX_GTM_DPLL_CTRL_5_WAD29_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_5_Bits.WAD29 */
#define IFX_GTM_DPLL_CTRL_5_WAD29_OFF (21u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_5_Bits.WAD30 */
#define IFX_GTM_DPLL_CTRL_5_WAD30_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_5_Bits.WAD30 */
#define IFX_GTM_DPLL_CTRL_5_WAD30_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_5_Bits.WAD30 */
#define IFX_GTM_DPLL_CTRL_5_WAD30_OFF (22u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_5_Bits.WAD31 */
#define IFX_GTM_DPLL_CTRL_5_WAD31_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_5_Bits.WAD31 */
#define IFX_GTM_DPLL_CTRL_5_WAD31_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_5_Bits.WAD31 */
#define IFX_GTM_DPLL_CTRL_5_WAD31_OFF (23u)

/** \brief Length for Ifx_GTM_DPLL_ACT_STA_Bits.ACT_N */
#define IFX_GTM_DPLL_ACT_STA_ACT_N_LEN (32u)

/** \brief Mask for Ifx_GTM_DPLL_ACT_STA_Bits.ACT_N */
#define IFX_GTM_DPLL_ACT_STA_ACT_N_MSK (0xffffffffu)

/** \brief Offset for Ifx_GTM_DPLL_ACT_STA_Bits.ACT_N */
#define IFX_GTM_DPLL_ACT_STA_ACT_N_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_OSW_Bits.SWON_S */
#define IFX_GTM_DPLL_OSW_SWON_S_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_OSW_Bits.SWON_S */
#define IFX_GTM_DPLL_OSW_SWON_S_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_OSW_Bits.SWON_S */
#define IFX_GTM_DPLL_OSW_SWON_S_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_OSW_Bits.SWON_T */
#define IFX_GTM_DPLL_OSW_SWON_T_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_OSW_Bits.SWON_T */
#define IFX_GTM_DPLL_OSW_SWON_T_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_OSW_Bits.SWON_T */
#define IFX_GTM_DPLL_OSW_SWON_T_OFF (1u)

/** \brief Length for Ifx_GTM_DPLL_OSW_Bits.OSS */
#define IFX_GTM_DPLL_OSW_OSS_LEN (2u)

/** \brief Mask for Ifx_GTM_DPLL_OSW_Bits.OSS */
#define IFX_GTM_DPLL_OSW_OSS_MSK (0x3u)

/** \brief Offset for Ifx_GTM_DPLL_OSW_Bits.OSS */
#define IFX_GTM_DPLL_OSW_OSS_OFF (8u)

/** \brief Length for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2A */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2A_LEN (8u)

/** \brief Mask for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2A */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2A_MSK (0xffu)

/** \brief Offset for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2A */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2A_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2B */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2B_LEN (8u)

/** \brief Mask for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2B */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2B_MSK (0xffu)

/** \brief Offset for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2B */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2B_OFF (8u)

/** \brief Length for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2C */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2C_LEN (8u)

/** \brief Mask for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2C */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2C_MSK (0xffu)

/** \brief Offset for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2C */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2C_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2D */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2D_LEN (8u)

/** \brief Mask for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2D */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2D_MSK (0xffu)

/** \brief Offset for Ifx_GTM_DPLL_AOSV_2_Bits.AOSV_2D */
#define IFX_GTM_DPLL_AOSV_2_AOSV_2D_OFF (24u)

/** \brief Length for Ifx_GTM_DPLL_APT_Bits.WAPT */
#define IFX_GTM_DPLL_APT_WAPT_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_APT_Bits.WAPT */
#define IFX_GTM_DPLL_APT_WAPT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_APT_Bits.WAPT */
#define IFX_GTM_DPLL_APT_WAPT_OFF (1u)

/** \brief Length for Ifx_GTM_DPLL_APT_Bits.APT */
#define IFX_GTM_DPLL_APT_APT_LEN (10u)

/** \brief Mask for Ifx_GTM_DPLL_APT_Bits.APT */
#define IFX_GTM_DPLL_APT_APT_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_DPLL_APT_Bits.APT */
#define IFX_GTM_DPLL_APT_APT_OFF (2u)

/** \brief Length for Ifx_GTM_DPLL_APT_Bits.WAPT_2B */
#define IFX_GTM_DPLL_APT_WAPT_2B_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_APT_Bits.WAPT_2B */
#define IFX_GTM_DPLL_APT_WAPT_2B_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_APT_Bits.WAPT_2B */
#define IFX_GTM_DPLL_APT_WAPT_2B_OFF (13u)

/** \brief Length for Ifx_GTM_DPLL_APT_Bits.APT_2B */
#define IFX_GTM_DPLL_APT_APT_2B_LEN (10u)

/** \brief Mask for Ifx_GTM_DPLL_APT_Bits.APT_2B */
#define IFX_GTM_DPLL_APT_APT_2B_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_DPLL_APT_Bits.APT_2B */
#define IFX_GTM_DPLL_APT_APT_2B_OFF (14u)

