veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.GL2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_GL2I_IRQ_EN_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.LL2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_LL2I_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.LL2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_LL2I_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.LL2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_LL2I_IRQ_EN_OFF (17u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TE0I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE0I_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TE0I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE0I_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TE0I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE0I_IRQ_EN_OFF (18u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TE1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE1I_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TE1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE1I_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TE1I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE1I_IRQ_EN_OFF (19u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TE2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE2I_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TE2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE2I_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TE2I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE2I_IRQ_EN_OFF (20u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TE3I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE3I_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TE3I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE3I_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TE3I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE3I_IRQ_EN_OFF (21u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TE4I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE4I_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TE4I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE4I_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TE4I_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TE4I_IRQ_EN_OFF (22u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.CDTI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_CDTI_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.CDTI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_CDTI_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.CDTI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_CDTI_IRQ_EN_OFF (23u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.CDSI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_CDSI_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.CDSI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_CDSI_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.CDSI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_CDSI_IRQ_EN_OFF (24u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.TORI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TORI_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.TORI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TORI_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.TORI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_TORI_IRQ_EN_OFF (25u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.SORI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_SORI_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.SORI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_SORI_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.SORI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_SORI_IRQ_EN_OFF (26u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_EN_Bits.DCGI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_DCGI_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_EN_Bits.DCGI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_DCGI_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_EN_Bits.DCGI_IRQ_EN */
#define IFX_GTM_DPLL_IRQ_EN_DCGI_IRQ_EN_OFF (27u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_PDI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_PDI_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_PDI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_PDI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_PDI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_PDI_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_PEI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_PEI_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_PEI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_PEI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_PEI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_PEI_OFF (1u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TINI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TINI_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TINI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TINI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TINI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TINI_OFF (2u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TAXI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TAXI_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TAXI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TAXI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TAXI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TAXI_OFF (3u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_SISI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_SISI_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_SISI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_SISI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_SISI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_SISI_OFF (4u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TISI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TISI_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TISI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TISI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_TISI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_TISI_OFF (5u)

/** \brief Length for Ifx_GTM_DPLL_IRQ_FORCINT_Bits.TRG_MSI */
#define IFX_GTM_DPLL_IRQ_FORCINT_TRG_MSI_LEN (1u)

