veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_DPLL_DTA_Bits.DTA */
#define IFX_GTM_DPLL_DTA_DTA_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_DTA_Bits.DTA */
#define IFX_GTM_DPLL_DTA_DTA_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_DTA_Bits.DTA */
#define IFX_GTM_DPLL_DTA_DTA_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_TS_T_Bits.TRIGGER_TS */
#define IFX_GTM_DPLL_TS_T_TRIGGER_TS_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_TS_T_Bits.TRIGGER_TS */
#define IFX_GTM_DPLL_TS_T_TRIGGER_TS_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_TS_T_Bits.TRIGGER_TS */
#define IFX_GTM_DPLL_TS_T_TRIGGER_TS_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_TS_T_OLD_Bits.TRIGGER_TS_OLD */
#define IFX_GTM_DPLL_TS_T_OLD_TRIGGER_TS_OLD_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_TS_T_OLD_Bits.TRIGGER_TS_OLD */
#define IFX_GTM_DPLL_TS_T_OLD_TRIGGER_TS_OLD_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_TS_T_OLD_Bits.TRIGGER_TS_OLD */
#define IFX_GTM_DPLL_TS_T_OLD_TRIGGER_TS_OLD_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_FTV_T_Bits.TRIGGER_FT */
#define IFX_GTM_DPLL_FTV_T_TRIGGER_FT_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_FTV_T_Bits.TRIGGER_FT */
#define IFX_GTM_DPLL_FTV_T_TRIGGER_FT_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_FTV_T_Bits.TRIGGER_FT */
#define IFX_GTM_DPLL_FTV_T_TRIGGER_FT_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_TS_S_Bits.STATE_TS */
#define IFX_GTM_DPLL_TS_S_STATE_TS_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_TS_S_Bits.STATE_TS */
#define IFX_GTM_DPLL_TS_S_STATE_TS_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_TS_S_Bits.STATE_TS */
#define IFX_GTM_DPLL_TS_S_STATE_TS_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_TS_S_OLD_Bits.STATE_TS_OLD */
#define IFX_GTM_DPLL_TS_S_OLD_STATE_TS_OLD_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_TS_S_OLD_Bits.STATE_TS_OLD */
#define IFX_GTM_DPLL_TS_S_OLD_STATE_TS_OLD_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_TS_S_OLD_Bits.STATE_TS_OLD */
#define IFX_GTM_DPLL_TS_S_OLD_STATE_TS_OLD_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_FTV_S_Bits.STATE_FT */
#define IFX_GTM_DPLL_FTV_S_STATE_FT_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_FTV_S_Bits.STATE_FT */
#define IFX_GTM_DPLL_FTV_S_STATE_FT_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_FTV_S_Bits.STATE_FT */
#define IFX_GTM_DPLL_FTV_S_STATE_FT_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_THMI_Bits.THMI */
#define IFX_GTM_DPLL_THMI_THMI_LEN (16u)

/** \brief Mask for Ifx_GTM_DPLL_THMI_Bits.THMI */
#define IFX_GTM_DPLL_THMI_THMI_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_DPLL_THMI_Bits.THMI */
#define IFX_GTM_DPLL_THMI_THMI_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_THMA_Bits.THMA */
#define IFX_GTM_DPLL_THMA_THMA_LEN (16u)

/** \brief Mask for Ifx_GTM_DPLL_THMA_Bits.THMA */
#define IFX_GTM_DPLL_THMA_THMA_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_DPLL_THMA_Bits.THMA */
#define IFX_GTM_DPLL_THMA_THMA_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_THVAL_Bits.THVAL */
#define IFX_GTM_DPLL_THVAL_THVAL_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_THVAL_Bits.THVAL */
#define IFX_GTM_DPLL_THVAL_THVAL_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_THVAL_Bits.THVAL */
#define IFX_GTM_DPLL_THVAL_THVAL_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_TOV_Bits.TOV_DB */
#define IFX_GTM_DPLL_TOV_TOV_DB_LEN (10u)

/** \brief Mask for Ifx_GTM_DPLL_TOV_Bits.TOV_DB */
#define IFX_GTM_DPLL_TOV_TOV_DB_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_DPLL_TOV_Bits.TOV_DB */
#define IFX_GTM_DPLL_TOV_TOV_DB_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_TOV_Bits.TOV_DW */
#define IFX_GTM_DPLL_TOV_TOV_DW_LEN (6u)

/** \brief Mask for Ifx_GTM_DPLL_TOV_Bits.TOV_DW */
#define IFX_GTM_DPLL_TOV_TOV_DW_MSK (0x3fu)

/** \brief Offset for Ifx_GTM_DPLL_TOV_Bits.TOV_DW */
#define IFX_GTM_DPLL_TOV_TOV_DW_OFF (10u)

/** \brief Length for Ifx_GTM_DPLL_TOV_S_Bits.DB */
#define IFX_GTM_DPLL_TOV_S_DB_LEN (10u)

/** \brief Mask for Ifx_GTM_DPLL_TOV_S_Bits.DB */
#define IFX_GTM_DPLL_TOV_S_DB_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_DPLL_TOV_S_Bits.DB */
#define IFX_GTM_DPLL_TOV_S_DB_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_TOV_S_Bits.DW */
#define IFX_GTM_DPLL_TOV_S_DW_LEN (6u)

/** \brief Mask for Ifx_GTM_DPLL_TOV_S_Bits.DW */
#define IFX_GTM_DPLL_TOV_S_DW_MSK (0x3fu)

/** \brief Offset for Ifx_GTM_DPLL_TOV_S_Bits.DW */
#define IFX_GTM_DPLL_TOV_S_DW_OFF (10u)

/** \brief Length for Ifx_GTM_DPLL_ADD_IN_CAL1_Bits.ADD_IN_CAL1 */
#define IFX_GTM_DPLL_ADD_IN_CAL1_ADD_IN_CAL1_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_ADD_IN_CAL1_Bits.ADD_IN_CAL1 */
#define IFX_GTM_DPLL_ADD_IN_CAL1_ADD_IN_CAL1_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_ADD_IN_CAL1_Bits.ADD_IN_CAL1 */
#define IFX_GTM_DPLL_ADD_IN_CAL1_ADD_IN_CAL1_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_ADD_IN_CAL2_Bits.ADD_IN_CAL2 */
#define IFX_GTM_DPLL_ADD_IN_CAL2_ADD_IN_CAL2_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_ADD_IN_CAL2_Bits.ADD_IN_CAL2 */
#define IFX_GTM_DPLL_ADD_IN_CAL2_ADD_IN_CAL2_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_ADD_IN_CAL2_Bits.ADD_IN_CAL2 */
#define IFX_GTM_DPLL_ADD_IN_CAL2_ADD_IN_CAL2_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_MPVAL1_Bits.MPVAL1 */
#define IFX_GTM_DPLL_MPVAL1_MPVAL1_LEN (16u)

/** \brief Mask for Ifx_GTM_DPLL_MPVAL1_Bits.MPVAL1 */
#define IFX_GTM_DPLL_MPVAL1_MPVAL1_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_DPLL_MPVAL1_Bits.MPVAL1 */
#define IFX_GTM_DPLL_MPVAL1_MPVAL1_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_MPVAL1_Bits.SIX1 */
#define IFX_GTM_DPLL_MPVAL1_SIX1_LEN (8u)

/** \brief Mask for Ifx_GTM_DPLL_MPVAL1_Bits.SIX1 */
#define IFX_GTM_DPLL_MPVAL1_SIX1_MSK (0xffu)

/** \brief Offset for Ifx_GTM_DPLL_MPVAL1_Bits.SIX1 */
#define IFX_GTM_DPLL_MPVAL1_SIX1_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_MPVAL2_Bits.MPVAL2 */
#define IFX_GTM_DPLL_MPVAL2_MPVAL2_LEN (16u)

/** \brief Mask for Ifx_GTM_DPLL_MPVAL2_Bits.MPVAL2 */
#define IFX_GTM_DPLL_MPVAL2_MPVAL2_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_DPLL_MPVAL2_Bits.MPVAL2 */
#define IFX_GTM_DPLL_MPVAL2_MPVAL2_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_MPVAL2_Bits.SIX2 */
#define IFX_GTM_DPLL_MPVAL2_SIX2_LEN (8u)

/** \brief Mask for Ifx_GTM_DPLL_MPVAL2_Bits.SIX2 */
#define IFX_GTM_DPLL_MPVAL2_SIX2_MSK (0xffu)

/** \brief Offset for Ifx_GTM_DPLL_MPVAL2_Bits.SIX2 */
#define IFX_GTM_DPLL_MPVAL2_SIX2_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_NMB_T_TAR_Bits.NMB_T_TAR */
#define IFX_GTM_DPLL_NMB_T_TAR_NMB_T_TAR_LEN (16u)

/** \brief Mask for Ifx_GTM_DPLL_NMB_T_TAR_Bits.NMB_T_TAR */
#define IFX_GTM_DPLL_NMB_T_TAR_NMB_T_TAR_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_DPLL_NMB_T_TAR_Bits.NMB_T_TAR */
#define IFX_GTM_DPLL_NMB_T_TAR_NMB_T_TAR_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits.NMB_T_TAR_OLD */
#define IFX_GTM_DPLL_NMB_T_TAR_OLD_NMB_T_TAR_OLD_LEN (16u)

/** \brief Mask for Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits.NMB_T_TAR_OLD */
#define IFX_GTM_DPLL_NMB_T_TAR_OLD_NMB_T_TAR_OLD_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_DPLL_NMB_T_TAR_OLD_Bits.NMB_T_TAR_OLD */
#define IFX_GTM_DPLL_NMB_T_TAR_OLD_NMB_T_TAR_OLD_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_NMB_S_TAR_Bits.NMB_S_TAR */
#define IFX_GTM_DPLL_NMB_S_TAR_NMB_S_TAR_LEN (20u)

/** \brief Mask for Ifx_GTM_DPLL_NMB_S_TAR_Bits.NMB_S_TAR */
#define IFX_GTM_DPLL_NMB_S_TAR_NMB_S_TAR_MSK (0xfffffu)

