veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_DPLL_TLR_Bits.TLR */
#define IFX_GTM_DPLL_TLR_TLR_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_SLR_Bits.SLR */
#define IFX_GTM_DPLL_SLR_SLR_LEN (8u)

/** \brief Mask for Ifx_GTM_DPLL_SLR_Bits.SLR */
#define IFX_GTM_DPLL_SLR_SLR_MSK (0xffu)

/** \brief Offset for Ifx_GTM_DPLL_SLR_Bits.SLR */
#define IFX_GTM_DPLL_SLR_SLR_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_PDT_Bits.DB */
#define IFX_GTM_DPLL_PDT_DB_LEN (14u)

/** \brief Mask for Ifx_GTM_DPLL_PDT_Bits.DB */
#define IFX_GTM_DPLL_PDT_DB_MSK (0x3fffu)

/** \brief Offset for Ifx_GTM_DPLL_PDT_Bits.DB */
#define IFX_GTM_DPLL_PDT_DB_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_PDT_Bits.DW */
#define IFX_GTM_DPLL_PDT_DW_LEN (10u)

/** \brief Mask for Ifx_GTM_DPLL_PDT_Bits.DW */
#define IFX_GTM_DPLL_PDT_DW_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_DPLL_PDT_Bits.DW */
#define IFX_GTM_DPLL_PDT_DW_OFF (14u)

/** \brief Length for Ifx_GTM_DPLL_MLS1_Bits.MLS1 */
#define IFX_GTM_DPLL_MLS1_MLS1_LEN (18u)

/** \brief Mask for Ifx_GTM_DPLL_MLS1_Bits.MLS1 */
#define IFX_GTM_DPLL_MLS1_MLS1_MSK (0x3ffffu)

/** \brief Offset for Ifx_GTM_DPLL_MLS1_Bits.MLS1 */
#define IFX_GTM_DPLL_MLS1_MLS1_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_MLS2_Bits.MLS2 */
#define IFX_GTM_DPLL_MLS2_MLS2_LEN (18u)

/** \brief Mask for Ifx_GTM_DPLL_MLS2_Bits.MLS2 */
#define IFX_GTM_DPLL_MLS2_MLS2_MSK (0x3ffffu)

/** \brief Offset for Ifx_GTM_DPLL_MLS2_Bits.MLS2 */
#define IFX_GTM_DPLL_MLS2_MLS2_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_CNT_NUM_1_Bits.CNT_NUM_1 */
#define IFX_GTM_DPLL_CNT_NUM_1_CNT_NUM_1_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_CNT_NUM_1_Bits.CNT_NUM_1 */
#define IFX_GTM_DPLL_CNT_NUM_1_CNT_NUM_1_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_CNT_NUM_1_Bits.CNT_NUM_1 */
#define IFX_GTM_DPLL_CNT_NUM_1_CNT_NUM_1_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_CNT_NUM_2_Bits.CNT_NUM_2 */
#define IFX_GTM_DPLL_CNT_NUM_2_CNT_NUM_2_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_CNT_NUM_2_Bits.CNT_NUM_2 */
#define IFX_GTM_DPLL_CNT_NUM_2_CNT_NUM_2_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_CNT_NUM_2_Bits.CNT_NUM_2 */
#define IFX_GTM_DPLL_CNT_NUM_2_CNT_NUM_2_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_PVT_Bits.PVT */
#define IFX_GTM_DPLL_PVT_PVT_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_PVT_Bits.PVT */
#define IFX_GTM_DPLL_PVT_PVT_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_PVT_Bits.PVT */
#define IFX_GTM_DPLL_PVT_PVT_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_PSTC_Bits.PSTC */
#define IFX_GTM_DPLL_PSTC_PSTC_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_PSTC_Bits.PSTC */
#define IFX_GTM_DPLL_PSTC_PSTC_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_PSTC_Bits.PSTC */
#define IFX_GTM_DPLL_PSTC_PSTC_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_PSSC_Bits.PSSC */
#define IFX_GTM_DPLL_PSSC_PSSC_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_PSSC_Bits.PSSC */
#define IFX_GTM_DPLL_PSSC_PSSC_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_PSSC_Bits.PSSC */
#define IFX_GTM_DPLL_PSSC_PSSC_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_PSTM_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_PSTM_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_PSTM_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_PSTM_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_PSTM_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_PSTM_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_PSTM_OLD_Bits.PSTM_OLD */
#define IFX_GTM_DPLL_PSTM_OLD_PSTM_OLD_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_PSTM_OLD_Bits.PSTM_OLD */
#define IFX_GTM_DPLL_PSTM_OLD_PSTM_OLD_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_PSTM_OLD_Bits.PSTM_OLD */
#define IFX_GTM_DPLL_PSTM_OLD_PSTM_OLD_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_PSSM_Bits.PSSM */
#define IFX_GTM_DPLL_PSSM_PSSM_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_PSSM_Bits.PSSM */
#define IFX_GTM_DPLL_PSSM_PSSM_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_PSSM_Bits.PSSM */
#define IFX_GTM_DPLL_PSSM_PSSM_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_PSSM_OLD_Bits.PSSM_OLD */
#define IFX_GTM_DPLL_PSSM_OLD_PSSM_OLD_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_PSSM_OLD_Bits.PSSM_OLD */
#define IFX_GTM_DPLL_PSSM_OLD_PSSM_OLD_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_PSSM_OLD_Bits.PSSM_OLD */
#define IFX_GTM_DPLL_PSSM_OLD_PSSM_OLD_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_NMB_T_Bits.NMB_T */
#define IFX_GTM_DPLL_NMB_T_NMB_T_LEN (16u)

/** \brief Mask for Ifx_GTM_DPLL_NMB_T_Bits.NMB_T */
#define IFX_GTM_DPLL_NMB_T_NMB_T_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_DPLL_NMB_T_Bits.NMB_T */
#define IFX_GTM_DPLL_NMB_T_NMB_T_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_NMB_S_Bits.NMB_S */
#define IFX_GTM_DPLL_NMB_S_NMB_S_LEN (20u)

/** \brief Mask for Ifx_GTM_DPLL_NMB_S_Bits.NMB_S */
#define IFX_GTM_DPLL_NMB_S_NMB_S_MSK (0xfffffu)

/** \brief Offset for Ifx_GTM_DPLL_NMB_S_Bits.NMB_S */
#define IFX_GTM_DPLL_NMB_S_NMB_S_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_RDT_S_Bits.RDT_S */
#define IFX_GTM_DPLL_RDT_S_RDT_S_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_RDT_S_Bits.RDT_S */
#define IFX_GTM_DPLL_RDT_S_RDT_S_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_RDT_S_Bits.RDT_S */
#define IFX_GTM_DPLL_RDT_S_RDT_S_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_TSF_S_Bits.TSF_S */
#define IFX_GTM_DPLL_TSF_S_TSF_S_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_TSF_S_Bits.TSF_S */
#define IFX_GTM_DPLL_TSF_S_TSF_S_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_TSF_S_Bits.TSF_S */
#define IFX_GTM_DPLL_TSF_S_TSF_S_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_ADT_S_Bits.PD_S */
#define IFX_GTM_DPLL_ADT_S_PD_S_LEN (16u)

/** \brief Mask for Ifx_GTM_DPLL_ADT_S_Bits.PD_S */
#define IFX_GTM_DPLL_ADT_S_PD_S_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_DPLL_ADT_S_Bits.PD_S */
#define IFX_GTM_DPLL_ADT_S_PD_S_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_ADT_S_Bits.NS */
#define IFX_GTM_DPLL_ADT_S_NS_LEN (6u)

/** \brief Mask for Ifx_GTM_DPLL_ADT_S_Bits.NS */
#define IFX_GTM_DPLL_ADT_S_NS_MSK (0x3fu)

/** \brief Offset for Ifx_GTM_DPLL_ADT_S_Bits.NS */
#define IFX_GTM_DPLL_ADT_S_NS_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_DT_S_Bits.DT_S */
#define IFX_GTM_DPLL_DT_S_DT_S_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_DT_S_Bits.DT_S */
#define IFX_GTM_DPLL_DT_S_DT_S_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_DT_S_Bits.DT_S */
#define IFX_GTM_DPLL_DT_S_DT_S_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_TSAC_Bits.TSAC */
#define IFX_GTM_DPLL_TSAC_TSAC_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_TSAC_Bits.TSAC */
#define IFX_GTM_DPLL_TSAC_TSAC_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_TSAC_Bits.TSAC */
#define IFX_GTM_DPLL_TSAC_TSAC_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_PSAC_Bits.PSAC */
#define IFX_GTM_DPLL_PSAC_PSAC_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_PSAC_Bits.PSAC */
#define IFX_GTM_DPLL_PSAC_PSAC_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_PSAC_Bits.PSAC */
#define IFX_GTM_DPLL_PSAC_PSAC_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_ACB_Bits.ACB_0 */
#define IFX_GTM_DPLL_ACB_ACB_0_LEN (5u)

