veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_SOMP_TRIGOUT_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_SOMP_TRIGOUT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.TRIGOUT */
#define IFX_GTM_ATOM_CH_SOMP_TRIGOUT_OFF (24u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.OSM */
#define IFX_GTM_ATOM_CH_SOMP_OSM_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.OSM */
#define IFX_GTM_ATOM_CH_SOMP_OSM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.OSM */
#define IFX_GTM_ATOM_CH_SOMP_OSM_OFF (26u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.EXT_FUPD */
#define IFX_GTM_ATOM_CH_SOMP_EXT_FUPD_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.EXT_FUPD */
#define IFX_GTM_ATOM_CH_SOMP_EXT_FUPD_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.EXT_FUPD */
#define IFX_GTM_ATOM_CH_SOMP_EXT_FUPD_OFF (29u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_SOMP_FREEZE_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_SOMP_FREEZE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_SOMP_FREEZE_OFF (31u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMS_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMS_MODE_LEN (2u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMS_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMS_MODE_MSK (0x3u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMS_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMS_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMS_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_SOMS_ARU_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMS_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_SOMS_ARU_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMS_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_SOMS_ARU_EN_OFF (3u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMS_Bits.ACB0 */
#define IFX_GTM_ATOM_CH_SOMS_ACB0_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMS_Bits.ACB0 */
#define IFX_GTM_ATOM_CH_SOMS_ACB0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMS_Bits.ACB0 */
#define IFX_GTM_ATOM_CH_SOMS_ACB0_OFF (4u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMS_Bits.DSO */
#define IFX_GTM_ATOM_CH_SOMS_DSO_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMS_Bits.DSO */
#define IFX_GTM_ATOM_CH_SOMS_DSO_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMS_Bits.DSO */
#define IFX_GTM_ATOM_CH_SOMS_DSO_OFF (7u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMS_Bits.SL */
#define IFX_GTM_ATOM_CH_SOMS_SL_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMS_Bits.SL */
#define IFX_GTM_ATOM_CH_SOMS_SL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMS_Bits.SL */
#define IFX_GTM_ATOM_CH_SOMS_SL_OFF (11u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMS_Bits.CLK_SRC_SR */
#define IFX_GTM_ATOM_CH_SOMS_CLK_SRC_SR_LEN (3u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMS_Bits.CLK_SRC_SR */
#define IFX_GTM_ATOM_CH_SOMS_CLK_SRC_SR_MSK (0x7u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMS_Bits.CLK_SRC_SR */
#define IFX_GTM_ATOM_CH_SOMS_CLK_SRC_SR_OFF (12u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMS_Bits.ECLK_SRC */
#define IFX_GTM_ATOM_CH_SOMS_ECLK_SRC_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMS_Bits.ECLK_SRC */
#define IFX_GTM_ATOM_CH_SOMS_ECLK_SRC_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMS_Bits.ECLK_SRC */
#define IFX_GTM_ATOM_CH_SOMS_ECLK_SRC_OFF (15u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMS_Bits.OSM */
#define IFX_GTM_ATOM_CH_SOMS_OSM_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMS_Bits.OSM */
#define IFX_GTM_ATOM_CH_SOMS_OSM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMS_Bits.OSM */
#define IFX_GTM_ATOM_CH_SOMS_OSM_OFF (26u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMS_Bits.EXT_FUPD */
#define IFX_GTM_ATOM_CH_SOMS_EXT_FUPD_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMS_Bits.EXT_FUPD */
#define IFX_GTM_ATOM_CH_SOMS_EXT_FUPD_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMS_Bits.EXT_FUPD */
#define IFX_GTM_ATOM_CH_SOMS_EXT_FUPD_OFF (29u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMS_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_SOMS_FREEZE_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMS_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_SOMS_FREEZE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMS_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_SOMS_FREEZE_OFF (31u)

/** \brief Length for Ifx_GTM_ATOM_CH_SR0_Bits.SR0 */
#define IFX_GTM_ATOM_CH_SR0_SR0_LEN (24u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SR0_Bits.SR0 */
#define IFX_GTM_ATOM_CH_SR0_SR0_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_ATOM_CH_SR0_Bits.SR0 */
#define IFX_GTM_ATOM_CH_SR0_SR0_OFF (0u)

/** \brief Length for Ifx_GTM_ATOM_CH_SR1_Bits.SR1 */
#define IFX_GTM_ATOM_CH_SR1_SR1_LEN (24u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SR1_Bits.SR1 */
#define IFX_GTM_ATOM_CH_SR1_SR1_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_ATOM_CH_SR1_Bits.SR1 */
#define IFX_GTM_ATOM_CH_SR1_SR1_OFF (0u)

/** \brief Length for Ifx_GTM_ATOM_CH_CM0_Bits.CM0 */
#define IFX_GTM_ATOM_CH_CM0_CM0_LEN (24u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CM0_Bits.CM0 */
#define IFX_GTM_ATOM_CH_CM0_CM0_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_ATOM_CH_CM0_Bits.CM0 */
#define IFX_GTM_ATOM_CH_CM0_CM0_OFF (0u)

/** \brief Length for Ifx_GTM_ATOM_CH_CM1_Bits.CM1 */
#define IFX_GTM_ATOM_CH_CM1_CM1_LEN (24u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CM1_Bits.CM1 */
#define IFX_GTM_ATOM_CH_CM1_CM1_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_ATOM_CH_CM1_Bits.CM1 */
#define IFX_GTM_ATOM_CH_CM1_CM1_OFF (0u)

/** \brief Length for Ifx_GTM_ATOM_CH_CN0_Bits.CN0 */
#define IFX_GTM_ATOM_CH_CN0_CN0_LEN (24u)

/** \brief Mask for Ifx_GTM_ATOM_CH_CN0_Bits.CN0 */
#define IFX_GTM_ATOM_CH_CN0_CN0_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_ATOM_CH_CN0_Bits.CN0 */
#define IFX_GTM_ATOM_CH_CN0_CN0_OFF (0u)

/** \brief Length for Ifx_GTM_ATOM_CH_STAT_Bits.OL */
#define IFX_GTM_ATOM_CH_STAT_OL_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_STAT_Bits.OL */
#define IFX_GTM_ATOM_CH_STAT_OL_MSK (0x1u)

