veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_MCS_CH_IRQ_EN_Bits.ERR_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_ERR_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_IRQ_EN_Bits.ERR_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_ERR_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_IRQ_EN_Bits.ERR_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_ERR_IRQ_EN_OFF (2u)

/** \brief Length for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_MCS_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_MCS_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_MCS_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_MCS_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_MCS_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_MCS_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_STK_ERR_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_STK_ERR_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_STK_ERR_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_ERR_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_ERR_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_IRQ_FORCINT_Bits.TRG_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_FORCINT_TRG_ERR_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_MCS_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_MCS_CH_IRQ_MODE_IRQ_MODE_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_MCS_CH_IRQ_MODE_IRQ_MODE_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_CH_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_MCS_CH_IRQ_MODE_IRQ_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.MCS_EIRQ_EN0 */
#define IFX_GTM_MCS_CH_EIRQ_EN_MCS_EIRQ_EN0_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.MCS_EIRQ_EN0 */
#define IFX_GTM_MCS_CH_EIRQ_EN_MCS_EIRQ_EN0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.MCS_EIRQ_EN0 */
#define IFX_GTM_MCS_CH_EIRQ_EN_MCS_EIRQ_EN0_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.STK_ERR_EIRQ_EN */
#define IFX_GTM_MCS_CH_EIRQ_EN_STK_ERR_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.STK_ERR_EIRQ_EN */
#define IFX_GTM_MCS_CH_EIRQ_EN_STK_ERR_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.STK_ERR_EIRQ_EN */
#define IFX_GTM_MCS_CH_EIRQ_EN_STK_ERR_EIRQ_EN_OFF (1u)

/** \brief Length for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.ERR_EIRQ_EN */
#define IFX_GTM_MCS_CH_EIRQ_EN_ERR_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.ERR_EIRQ_EN */
#define IFX_GTM_MCS_CH_EIRQ_EN_ERR_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_EIRQ_EN_Bits.ERR_EIRQ_EN */
#define IFX_GTM_MCS_CH_EIRQ_EN_ERR_EIRQ_EN_OFF (2u)

/** \brief Length for Ifx_GTM_MCS_REG_PROT_Bits.WPROT0 */
#define IFX_GTM_MCS_REG_PROT_WPROT0_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_REG_PROT_Bits.WPROT0 */
#define IFX_GTM_MCS_REG_PROT_WPROT0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_REG_PROT_Bits.WPROT0 */
#define IFX_GTM_MCS_REG_PROT_WPROT0_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_REG_PROT_Bits.WPROT1 */
#define IFX_GTM_MCS_REG_PROT_WPROT1_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_REG_PROT_Bits.WPROT1 */
#define IFX_GTM_MCS_REG_PROT_WPROT1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_REG_PROT_Bits.WPROT1 */
#define IFX_GTM_MCS_REG_PROT_WPROT1_OFF (2u)

/** \brief Length for Ifx_GTM_MCS_REG_PROT_Bits.WPROT2 */
#define IFX_GTM_MCS_REG_PROT_WPROT2_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_REG_PROT_Bits.WPROT2 */
#define IFX_GTM_MCS_REG_PROT_WPROT2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_REG_PROT_Bits.WPROT2 */
#define IFX_GTM_MCS_REG_PROT_WPROT2_OFF (4u)

/** \brief Length for Ifx_GTM_MCS_REG_PROT_Bits.WPROT3 */
#define IFX_GTM_MCS_REG_PROT_WPROT3_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_REG_PROT_Bits.WPROT3 */
#define IFX_GTM_MCS_REG_PROT_WPROT3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_REG_PROT_Bits.WPROT3 */
#define IFX_GTM_MCS_REG_PROT_WPROT3_OFF (6u)

/** \brief Length for Ifx_GTM_MCS_REG_PROT_Bits.WPROT4 */
#define IFX_GTM_MCS_REG_PROT_WPROT4_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_REG_PROT_Bits.WPROT4 */
#define IFX_GTM_MCS_REG_PROT_WPROT4_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_REG_PROT_Bits.WPROT4 */
#define IFX_GTM_MCS_REG_PROT_WPROT4_OFF (8u)

/** \brief Length for Ifx_GTM_MCS_REG_PROT_Bits.WPROT5 */
#define IFX_GTM_MCS_REG_PROT_WPROT5_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_REG_PROT_Bits.WPROT5 */
#define IFX_GTM_MCS_REG_PROT_WPROT5_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_REG_PROT_Bits.WPROT5 */
#define IFX_GTM_MCS_REG_PROT_WPROT5_OFF (10u)

/** \brief Length for Ifx_GTM_MCS_REG_PROT_Bits.WPROT6 */
#define IFX_GTM_MCS_REG_PROT_WPROT6_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_REG_PROT_Bits.WPROT6 */
#define IFX_GTM_MCS_REG_PROT_WPROT6_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_REG_PROT_Bits.WPROT6 */
#define IFX_GTM_MCS_REG_PROT_WPROT6_OFF (12u)

/** \brief Length for Ifx_GTM_MCS_REG_PROT_Bits.WPROT7 */
#define IFX_GTM_MCS_REG_PROT_WPROT7_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_REG_PROT_Bits.WPROT7 */
#define IFX_GTM_MCS_REG_PROT_WPROT7_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_REG_PROT_Bits.WPROT7 */
#define IFX_GTM_MCS_REG_PROT_WPROT7_OFF (14u)

/** \brief Length for Ifx_GTM_MCS_CTRL_STAT_Bits.SCD_MODE */
#define IFX_GTM_MCS_CTRL_STAT_SCD_MODE_LEN (2u)

/** \brief Mask for Ifx_GTM_MCS_CTRL_STAT_Bits.SCD_MODE */
#define IFX_GTM_MCS_CTRL_STAT_SCD_MODE_MSK (0x3u)

/** \brief Offset for Ifx_GTM_MCS_CTRL_STAT_Bits.SCD_MODE */
#define IFX_GTM_MCS_CTRL_STAT_SCD_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_CTRL_STAT_Bits.SCD_CH */
#define IFX_GTM_MCS_CTRL_STAT_SCD_CH_LEN (4u)

/** \brief Mask for Ifx_GTM_MCS_CTRL_STAT_Bits.SCD_CH */
#define IFX_GTM_MCS_CTRL_STAT_SCD_CH_MSK (0xfu)

/** \brief Offset for Ifx_GTM_MCS_CTRL_STAT_Bits.SCD_CH */
#define IFX_GTM_MCS_CTRL_STAT_SCD_CH_OFF (8u)

/** \brief Length for Ifx_GTM_MCS_CTRL_STAT_Bits.RAM_RST */
#define IFX_GTM_MCS_CTRL_STAT_RAM_RST_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CTRL_STAT_Bits.RAM_RST */
#define IFX_GTM_MCS_CTRL_STAT_RAM_RST_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CTRL_STAT_Bits.RAM_RST */
#define IFX_GTM_MCS_CTRL_STAT_RAM_RST_OFF (16u)

/** \brief Length for Ifx_GTM_MCS_CTRL_STAT_Bits.HLT_SP_OFL */
#define IFX_GTM_MCS_CTRL_STAT_HLT_SP_OFL_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CTRL_STAT_Bits.HLT_SP_OFL */
#define IFX_GTM_MCS_CTRL_STAT_HLT_SP_OFL_MSK (0x1u)

